// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");

Задача 4: Напишите программу, которая на вход принимает натуральное число N, а на выходе показывает его цифры через запятую.