// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");

Задача 3: Напишите программу, которая принимает на вход целое число из отрезка [10, 99] и показывает наибольшую цифру числа.